# Этот файл нужен для разбора каких-то примеров. Здесь также могут быть оставлены нужные заметки.
#from selenium import webdriver

#Драйвер скачивается на локальную машину, и прописывается в переменную PATH.
#Проверка осуществляется через консоль командой Path и затем вызовом chromedriver.
#driver = webdriver.Chrome('C:\\chromedriver\\chromedriver')
#url = driver.get('https://mail.ru')
#close_brow = driver.quit() #закрывать окно браузера нужно для сохранения оперативной памяти.

# !!! from selenium.webdriver.common.by import By - ЭТО ВАЖНО ДЛЯ "пэйдж обджект модел" вернуться к 1.6 второй квадрат.

# !!! Вернуться к детальному изучению селекторов (возможно хпаф) для lesson6_step10_first_assert там правильно, но есть ещё способы.

# !!! ОБЯЗАТЕЛЬНО подробнее про гит урок 3.1 степ 6 !!!!

# 1/ git add название файла (регистр).
# 2/ git commit -m "сообщение о коммите" (без флага == без сообщения)
# 3. git push origin main (master для старого проекта). - это уже на  сервер пойдет, а не локально.
# Все эти файлы должны быть в локальном репозитории
# !!! ДЛЯ ГИТА почитать информацию с последнего квадратика в 3.1

